```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.external.git: Refreshing state... [id=-]
module.aws_organization.random_string.random: Refreshing state... [id=si38]
module.aws_organization.random_string.random: Refreshing state... [id=rVB1x]
module.serverless_api["example"].module.repository.github_repository.repository: Refreshing state... [id=serverless-example-api]
module.aws_organization.aws_organizations_account.account: Refreshing state... [id=656889719924]
module.aws_organization.aws_organizations_account.account: Refreshing state... [id=781149127351]
module.aws_logging.data.aws_caller_identity.current: Refreshing state... [id=2020-08-14 16:37:03.914415114 +0000 UTC]
module.aws_logging.data.aws_partition.current: Refreshing state... [id=2020-08-14 16:37:03.773694363 +0000 UTC]
module.aws_logging.data.aws_iam_policy_document.bucket_policy: Refreshing state... [id=940977880]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.aws_api_gateway.aws_api_gateway_account.account will be created
  + resource "aws_api_gateway_account" "account" {
      + cloudwatch_role_arn = (known after apply)
      + id                  = (known after apply)
      + throttle_settings   = (known after apply)
    }

  # module.aws_api_gateway.aws_iam_role.api_gateway_cloudwatch will be created
  + resource "aws_iam_role" "api_gateway_cloudwatch" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "apigateway.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "api-gateway-cloudwatch"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.aws_api_gateway.aws_iam_role_policy.api_gateway_cloudwatch will be created
  + resource "aws_iam_role_policy" "api_gateway_cloudwatch" {
      + id     = (known after apply)
      + name   = "default"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                          + "logs:PutLogEvents",
                          + "logs:GetLogEvents",
                          + "logs:FilterLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.aws_logging.aws_cloudtrail.cloudtrail will be created
  + resource "aws_cloudtrail" "cloudtrail" {
      + arn                           = (known after apply)
      + enable_log_file_validation    = true
      + enable_logging                = true
      + home_region                   = (known after apply)
      + id                            = (known after apply)
      + include_global_service_events = true
      + is_multi_region_trail         = true
      + is_organization_trail         = false
      + name                          = "cloudtrail"
      + s3_bucket_name                = "scaffoldly-si38-logs"

      + event_selector {
          + include_management_events = true
          + read_write_type           = "All"

          + data_resource {
              + type   = "AWS::S3::Object"
              + values = [
                  + "arn:aws:s3:::",
                ]
            }
        }
      + event_selector {
          + include_management_events = true
          + read_write_type           = "All"

          + data_resource {
              + type   = "AWS::Lambda::Function"
              + values = [
                  + "arn:aws:lambda",
                ]
            }
        }
    }

  # module.aws_logging.aws_s3_bucket.logs will be created
  + resource "aws_s3_bucket" "logs" {
      + acceleration_status         = (known after apply)
      + acl                         = "log-delivery-write"
      + arn                         = (known after apply)
      + bucket                      = "scaffoldly-si38-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = (known after apply)

          + noncurrent_version_transition {
              + days          = 180
              + storage_class = "DEEP_ARCHIVE"
            }
          + noncurrent_version_transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
          + noncurrent_version_transition {
              + days          = 60
              + storage_class = "GLACIER"
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.aws_logging.aws_s3_bucket_policy.bucket_policy will be created
  + resource "aws_s3_bucket_policy" "bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:PutObject"
                      + Condition = {
                          + StringEquals = {
                              + s3:x-amz-acl = "bucket-owner-full-control"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "delivery.logs.amazonaws.com",
                              + "cloudtrail.amazonaws.com",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::scaffoldly-si38-logs/AWSLogs/656889719924/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetBucketAcl"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "delivery.logs.amazonaws.com",
                              + "cloudtrail.amazonaws.com",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::scaffoldly-si38-logs"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.aws_organization.random_string.random (deposed object 91adf423) will be destroyed
  - resource "random_string" "random" {
      - id          = "rVB1x" -> null
      - length      = 5 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - result      = "rVB1x" -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # module.dns.aws_route53_delegation_set.main will be created
  + resource "aws_route53_delegation_set" "main" {
      + id           = (known after apply)
      + name_servers = (known after apply)
    }

  # module.dns.module.dns[0].aws_acm_certificate.apex_wildcard will be created
  + resource "aws_acm_certificate" "apex_wildcard" {
      + arn                       = (known after apply)
      + domain_name               = "scaffoldly.dev"
      + domain_validation_options = [
          + {
              + domain_name           = "scaffoldly.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.dns.module.dns[0].aws_acm_certificate.subdomain_wildcard will be created
  + resource "aws_acm_certificate" "subdomain_wildcard" {
      + arn                       = (known after apply)
      + domain_name               = "*.scaffoldly.dev"
      + domain_validation_options = [
          + {
              + domain_name           = "*.scaffoldly.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.dns.module.dns[0].aws_route53_record.apex_wildcard["scaffoldly.dev"] will be created
  + resource "aws_route53_record" "apex_wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.dns.module.dns[0].aws_route53_record.subdomain_wildcard["*.scaffoldly.dev"] will be created
  + resource "aws_route53_record" "subdomain_wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.dns.module.dns[0].aws_route53_zone.zone will be created
  + resource "aws_route53_zone" "zone" {
      + comment           = "Managed by Terraform"
      + delegation_set_id = (known after apply)
      + force_destroy     = false
      + id                = (known after apply)
      + name              = "scaffoldly.dev"
      + name_servers      = (known after apply)
      + zone_id           = (known after apply)
    }

  # module.dns.module.dns[1].aws_acm_certificate.apex_wildcard will be created
  + resource "aws_acm_certificate" "apex_wildcard" {
      + arn                       = (known after apply)
      + domain_name               = "scaffold.ly"
      + domain_validation_options = [
          + {
              + domain_name           = "scaffold.ly"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.dns.module.dns[1].aws_acm_certificate.subdomain_wildcard will be created
  + resource "aws_acm_certificate" "subdomain_wildcard" {
      + arn                       = (known after apply)
      + domain_name               = "*.scaffold.ly"
      + domain_validation_options = [
          + {
              + domain_name           = "*.scaffold.ly"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.dns.module.dns[1].aws_route53_record.apex_wildcard["scaffold.ly"] will be created
  + resource "aws_route53_record" "apex_wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.dns.module.dns[1].aws_route53_record.subdomain_wildcard["*.scaffold.ly"] will be created
  + resource "aws_route53_record" "subdomain_wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.dns.module.dns[1].aws_route53_zone.zone will be created
  + resource "aws_route53_zone" "zone" {
      + comment           = "Managed by Terraform"
      + delegation_set_id = (known after apply)
      + force_destroy     = false
      + id                = (known after apply)
      + name              = "scaffold.ly"
      + name_servers      = (known after apply)
      + zone_id           = (known after apply)
    }

Plan: 17 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + main_nameservers = (known after apply)

------------------------------------------------------------------------

This plan was saved to: planfile

To perform exactly these actions, run the following command to apply:
    terraform apply "planfile"

\n\n0
```